1. git init
   Описание: Инициализирует новый репозиторий Git.
   Пример: git init

2. git clone
   Описание: Клонирует существующий репозиторий в новый каталог.
   Пример: git clone <URL_репозитория>

3. git add
   Описание: Добавляет изменения в рабочей директории в индекс (staging area) для последующего коммита.
   Пример: git add <имя_файла>

4. git commit
   Описание: Фиксирует состояние индекса в репозитории.
   Пример: git commit -m "Сообщение коммита"

5. git status
   Описание: Показывает состояние рабочей директории и индекса.
   Пример: git status

6. git push
   Описание: Отправляет все локальные коммиты на удаленный репозиторий.
   Пример: git push <удаленный_репозиторий> <ветка>

7. git pull
   Описание: Забирает изменения из удаленного репозитория и интегрирует их в текущую ветку.
   Пример: git pull <удаленный_репозиторий> <ветка>

8. git branch
   Описание: Показывает, создает или удаляет ветки.
   Пример: git branch, git branch <новая_ветка>, git branch -d <удалить_ветку>

9. git merge
   Описание: Объединяет изменения из одной ветки в другую.
   Пример: git merge <имя_ветки>

10. git log
    Описание: Показывает историю коммитов.
    Пример: git log
